In [52]:
import pandas as pd
import numpy as np

# 文件读取与保存

In [56]:
'''
   read_csv
'''
#读取csv
data = pd.read_csv('data1.csv',encoding='gbk')
data

   Unnamed: 0  name  age  count
0           0  罗纳尔多   33      4
1           1    梅西   30      1
2           2   姆巴佩   18      4

In [57]:
#读取文本
data2 = pd.read_csv('data1.txt')
data2

  name::age::count
0   ronlado::33::4
1     messi::30::1
2    mubsid::18::4

In [58]:
data2 = pd.read_csv('data1.txt',sep = '::')
data2

/Users/qinxin/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

      name  age  count
0  ronlado   33      4
1    messi   30      1
2   mubsid   18      4

In [59]:
data2 = pd.read_csv('data1.txt',sep = '::',engine='python')
data2

      name  age  count
0  ronlado   33      4
1    messi   30      1
2   mubsid   18      4

In [60]:
#读取Excel
data3= pd.read_excel('data2.xlsx')
data3

   Unnamed: 0     name  age  count
0           0  ronlado   33      4
1           1    messi   30      1
2           2   mubsid   18      4

In [61]:
'''
   保存文件
'''
data3['name'] = ['c罗纳尔多','梅西','姆巴佩']
data3

   Unnamed: 0   name  age  count
0           0  c罗纳尔多   33      4
1           1     梅西   30      1
2           2    姆巴佩   18      4

In [62]:
#保存文件为football.csv
data3.to_csv('football.csv',index = False)

In [63]:
football = pd.read_csv('football.csv',header = None,names=['a','b','c'])
football

                a    b      c
Unnamed: 0   name  age  count
0           c罗纳尔多   33      4
1              梅西   30      1
2             姆巴佩   18      4

In [65]:
'''
   数据的过滤与获取
'''
football.columns[:2]

Index(['a', 'b'], dtype='object')

In [66]:
football[football.columns[:2]]

                a    b
Unnamed: 0   name  age
0           c罗纳尔多   33
1              梅西   30
2             姆巴佩   18

In [76]:
'''
   缺失值处理
'''
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01.loc['B','c'] = np.NaN
df01.loc['C','b'] = np.NaN
df01

   a    b    c  d
A  1  8.0  4.0  8
B  2  6.0  NaN  1
C  7  NaN  6.0  7
D  4  3.0  4.0  5

In [77]:
df01.isnull()

       a      b      c      d
A  False  False  False  False
B  False  False   True  False
C  False   True  False  False
D  False  False  False  False

In [78]:
df01['b'].isnull()

A    False
B    False
C     True
D    False
Name: b, dtype: bool

In [71]:
'''
   drop
''' 
df01.dropna()  #默认会删除带有NaN的行 只要包含一个就整行删除

   a    b    c  d
A  3  4.0  5.0  3
D  7  6.0  6.0  1

In [80]:
df01.dropna(axis=1)  #删除列中带有NaN的列

   a  d
A  1  8
B  2  1
C  7  7
D  4  5

In [82]:
df01.loc['E'] = np.NaN
df01

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0
E  NaN  NaN  NaN  NaN

In [83]:
#设置阈值
df01.dropna(how = 'all') #删除整行为NaN的行

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0

In [87]:
df01.loc['E'] = np.NaN
df01

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0
E  NaN  NaN  NaN  NaN

In [88]:
'''
   fillna 处理
'''
df01.fillna(0)  #将所有的NaN数据替换成0
df01

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0
E  NaN  NaN  NaN  NaN

In [90]:
df01.fillna(method = 'ffill')  #根据前一个值进行替换
df01

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0
E  NaN  NaN  NaN  NaN

In [91]:
df01.fillna(method = 'bfill')  #根据后一个值进行替换
df01

     a    b    c    d
A  1.0  8.0  4.0  8.0
B  2.0  6.0  NaN  1.0
C  7.0  NaN  6.0  7.0
D  4.0  3.0  4.0  5.0
E  NaN  NaN  NaN  NaN

In [92]:
df01.fillna('b':100,'c':200)  #根据列进行替换
df01

SyntaxError: invalid syntax (<ipython-input-92-43e569fb9f94>, line 1)

In [93]:
df01.replace(np.NaN:'hahah',1:'heiheih')  #根据值进行替换
df01

SyntaxError: invalid syntax (<ipython-input-93-8b375596be43>, line 1)

# 常用数学统计函数

In [95]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01

   a  b  c  d
A  5  8  8  4
B  7  3  5  1
C  4  7  4  2
D  8  1  5  4

In [96]:
'''
   count
'''
df01.count()

a    4
b    4
c    4
d    4
dtype: int64

In [97]:
ser01 = pd.Series(np.random.randint(1,5,6),index = list('abcdef'))
ser01

a    3
b    1
c    4
d    4
e    3
f    4
dtype: int64

In [99]:
df01.count(axis=1)

A    4
B    4
C    4
D    4
dtype: int64

In [98]:
ser01.count() #统计数量

6

In [100]:
'''
   discribe
'''
df01.describe()

              a         b         c     d
count  4.000000  4.000000  4.000000  4.00
mean   6.000000  4.750000  5.500000  2.75
std    1.825742  3.304038  1.732051  1.50
min    4.000000  1.000000  4.000000  1.00
25%    4.750000  2.500000  4.750000  1.75
50%    6.000000  5.000000  5.000000  3.00
75%    7.250000  7.250000  5.750000  4.00
max    8.000000  8.000000  8.000000  4.00

In [102]:
'''
   min
'''
df01.min(axis=1)

A    4
B    1
C    2
D    1
dtype: int64

In [103]:
'''
   sum
'''
df01.sum()

a    24
b    19
c    22
d    11
dtype: int64

In [104]:
df01.mad()   #平均绝对距离差

a    1.50
b    2.75
c    1.25
d    1.25
dtype: float64

In [105]:
'''
  cumsum  样本累计和
'''
df01.cumsum()

    a   b   c   d
A   5   8   8   4
B  12  11  13   5
C  16  18  17   7
D  24  19  22  11

In [106]:
df01

   a  b  c  d
A  5  8  8  4
B  7  3  5  1
C  4  7  4  2
D  8  1  5  4

In [108]:
df01.pct_change()  #计算增长率

          a         b      c     d
A       NaN       NaN    NaN   NaN
B  0.400000 -0.625000 -0.375 -0.75
C -0.428571  1.333333 -0.200  1.00
D  1.000000 -0.857143  0.250  1.00

# 相关系数与协方差

In [110]:
df01 = pd.DataFrame({
    'kill':[5,6,3,8],
    'duanwei':[1,2,3,4]
})
df01

   kill  duanwei
0     5        1
1     6        2
2     3        3
3     8        4

In [111]:
df01['kill'].cov(df01['duanwei'])  #cov协方差

1.0

In [112]:
df01['kill'].corr(df01['duanwei'])  #corr相关系数

0.3721042037676254

# 唯一值、值计数、成员资格

In [113]:
ser01 = pd.Series(np.random.randint(1,5,6),index = list('abcdef'))
ser01

a    2
b    2
c    1
d    4
e    4
f    3
dtype: int64

In [114]:
ser01.unique()

array([2, 1, 4, 3])

In [117]:
ser01.value_counts()  #查看该值出现的次数

4    2
2    2
3    1
1    1
dtype: int64

In [118]:
ser01.isin([2,3])

a     True
b     True
c    False
d    False
e    False
f     True
dtype: bool

In [119]:
ser01.index.isin(['a','b'])

array([ True,  True, False, False, False, False])

In [133]:
df01 = pd.DataFrame({
    'movie_name':list('abddeabg'),
    'rating':[1,2,3,4,5,4,3,4]
})
df01

  movie_name  rating
0          a       1
1          b       2
2          d       3
3          d       4
4          e       5
5          a       4
6          b       3
7          g       4

In [134]:
df01['movie_name'].unique()

array(['a', 'b', 'd', 'e', 'g'], dtype=object)

In [135]:
df01['movie_name'].value_counts()

d    2
a    2
b    2
e    1
g    1
Name: movie_name, dtype: int64

In [139]:
df01['movie_name'].isin(['a','b'])

0     True
1     True
2    False
3    False
4    False
5     True
6     True
7    False
Name: movie_name, dtype: bool

# 层次索引

In [141]:
ser01 = pd.Series([30,33,35,18,20,30],index=[
    [2017,2017,2017,2018,2018,2018],
    ['messi','cr7','nermaer','messi','cr7','nermaer']
])
ser01

2017  messi      30
      cr7        33
      nermaer    35
2018  messi      18
      cr7        20
      nermaer    30
dtype: int64

In [143]:
ser01[2017]

messi      30
cr7        33
nermaer    35
dtype: int64

In [144]:
#获取数据
ser01[2017]['messi']

30

In [146]:
ser01[:,'nermaer']

2017    35
2018    30
dtype: int64

In [148]:
ser01.swaplevel().sort_index()  #swaplevel交换行标签索引

cr7      2017    33
         2018    20
messi    2017    30
         2018    18
nermaer  2017    35
         2018    30
dtype: int64

In [154]:
ser01[:2017]

2017  messi      30
      cr7        33
      nermaer    35
2018  messi      18
      cr7        20
      nermaer    30
dtype: int64

In [155]:
#转换成DataFrame
ser01.unstack()

      cr7  messi  nermaer
2017   33     30       35
2018   20     18       30

In [158]:
ser01 = ser01.unstack()
ser01

         2017  2018
cr7        33    20
messi      30    18
nermaer    35    30

In [159]:
ser01.stack()

cr7      2017    33
         2018    20
messi    2017    30
         2018    18
nermaer  2017    35
         2018    30
dtype: int64

In [177]:
'''
   DataFrame
'''
df01 = pd.DataFrame({
    'year':[2017,2017,2017,2018,2018,2018],
    'goal':[30,33,35,18,20,30],
    'name':['messi','cr7','nermaer','messi','cr7','nermaer']
})
df01

   year  goal     name
0  2017    30    messi
1  2017    33      cr7
2  2017    35  nermaer
3  2018    18    messi
4  2018    20      cr7
5  2018    30  nermaer

In [178]:
df01.set_index('year')

      goal     name
year
2017    30    messi
2017    33      cr7
2017    35  nermaer
2018    18    messi
2018    20      cr7
2018    30  nermaer

In [179]:
df01.set_index(['year','name'])

              goal
year name
2017 messi      30
     cr7        33
     nermaer    35
2018 messi      18
     cr7        20
     nermaer    30

In [180]:
df01.loc[0]

year     2017
goal       30
name    messi
Name: 0, dtype: object

In [188]:
df01

   year  goal     name
0  2017    30    messi
1  2017    33      cr7
2  2017    35  nermaer
3  2018    18    messi
4  2018    20      cr7
5  2018    30  nermaer

In [189]:
df02 = df01.unstack()
df02

year  0       2017
      1       2017
      2       2017
      3       2018
      4       2018
      5       2018
goal  0         30
      1         33
      2         35
      3         18
      4         20
      5         30
name  0      messi
      1        cr7
      2    nermaer
      3      messi
      4        cr7
      5    nermaer
dtype: object

In [230]:
#df01 = df02.stack()
df01

   data2 key
0      2   a
1      3   b
2      4   c
3      5   d
4      6   e

In [229]:
#df01.sum(level= 'year')

# 排序

In [194]:
'''
   sort_index
'''
ser01 = pd.Series([1,2,3,4,5,6],index = list('bdcade'))
ser01

b    1
d    2
c    3
a    4
d    5
e    6
dtype: int64

In [195]:
ser01.sort_index() #通过索引进行排序

a    4
b    1
c    3
d    2
d    5
e    6
dtype: int64

In [196]:
ser01.sort_index(ascending = True)  #正序

a    4
b    1
c    3
d    2
d    5
e    6
dtype: int64

In [197]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('BCDA'),columns = list('cadb'))
df01

   c  a  d  b
B  1  8  3  2
C  3  5  3  7
D  3  4  7  7
A  4  4  1  6

In [199]:
df01.sort_index(axis=0)  #默认对行索引进行排序

   c  a  d  b
A  4  4  1  6
B  1  8  3  2
C  3  5  3  7
D  3  4  7  7

In [200]:
df01.sort_index(axis=1)

   a  b  c  d
B  8  2  1  3
C  5  7  3  3
D  4  7  3  7
A  4  6  4  1

In [202]:
'''
   sort_values
'''
ser01 = pd.Series([4,5,2,7,1,3],index = list('bdcade'))
ser01

b    4
d    5
c    2
a    7
d    1
e    3
dtype: int64

In [204]:
ser01.sort_values(ascending = False) #倒序

a    7
d    5
b    4
e    3
c    2
d    1
dtype: int64

In [205]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('BCDA'),columns = list('cadb'))
df01

   c  a  d  b
B  4  5  2  2
C  8  8  2  3
D  6  6  8  7
A  1  5  7  5

In [208]:
df01.sort_values(by = 'a')  #根据a的值排序

   c  a  d  b
B  4  5  2  2
A  1  5  7  5
D  6  6  8  7
C  8  8  2  3

In [211]:
df01.sort_values(by = ['a','c'],ascending = False)

   c  a  d  b
C  8  8  2  3
D  6  6  8  7
B  4  5  2  2
A  1  5  7  5

In [212]:
'''
   rank  排名
'''
ser01 = pd.Series([4,5,2,2,1],index = list('bdcad'))
ser01

b    4
d    5
c    2
a    2
d    1
dtype: int64

In [213]:
ser01.rank()  #2,3  2.5

b    4.0
d    5.0
c    2.5
a    2.5
d    1.0
dtype: float64

In [214]:
ser01.rank(method = 'min')

b    4.0
d    5.0
c    2.0
a    2.0
d    1.0
dtype: float64

In [215]:
ser01.rank(method = 'max')

b    4.0
d    5.0
c    3.0
a    3.0
d    1.0
dtype: float64

In [216]:
ser01.rank(method = 'first')

b    4.0
d    5.0
c    2.0
a    3.0
d    1.0
dtype: float64

# 时间序列

In [218]:
pd.date_range(start= '20190709',end = '20190730')

DatetimeIndex(['2019-07-09', '2019-07-10', '2019-07-11', '2019-07-12',
               '2019-07-13', '2019-07-14', '2019-07-15', '2019-07-16',
               '2019-07-17', '2019-07-18', '2019-07-19', '2019-07-20',
               '2019-07-21', '2019-07-22', '2019-07-23', '2019-07-24',
               '2019-07-25', '2019-07-26', '2019-07-27', '2019-07-28',
               '2019-07-29', '2019-07-30'],
              dtype='datetime64[ns]', freq='D')

In [219]:
pd.date_range(start= '20190709',end = '20190730',freq = '2d')  #freq步长

DatetimeIndex(['2019-07-09', '2019-07-11', '2019-07-13', '2019-07-15',
               '2019-07-17', '2019-07-19', '2019-07-21', '2019-07-23',
               '2019-07-25', '2019-07-27', '2019-07-29'],
              dtype='datetime64[ns]', freq='2D')

In [220]:
pd.date_range(start= '20190709',end = '20190730',freq = 'h')

DatetimeIndex(['2019-07-09 00:00:00', '2019-07-09 01:00:00',
               '2019-07-09 02:00:00', '2019-07-09 03:00:00',
               '2019-07-09 04:00:00', '2019-07-09 05:00:00',
               '2019-07-09 06:00:00', '2019-07-09 07:00:00',
               '2019-07-09 08:00:00', '2019-07-09 09:00:00',
               ...
               '2019-07-29 15:00:00', '2019-07-29 16:00:00',
               '2019-07-29 17:00:00', '2019-07-29 18:00:00',
               '2019-07-29 19:00:00', '2019-07-29 20:00:00',
               '2019-07-29 21:00:00', '2019-07-29 22:00:00',
               '2019-07-29 23:00:00', '2019-07-30 00:00:00'],
              dtype='datetime64[ns]', length=505, freq='H')

In [221]:
pd.date_range(start= '20190709',end = '20190710',freq = '10min')

DatetimeIndex(['2019-07-09 00:00:00', '2019-07-09 00:10:00',
               '2019-07-09 00:20:00', '2019-07-09 00:30:00',
               '2019-07-09 00:40:00', '2019-07-09 00:50:00',
               '2019-07-09 01:00:00', '2019-07-09 01:10:00',
               '2019-07-09 01:20:00', '2019-07-09 01:30:00',
               ...
               '2019-07-09 22:30:00', '2019-07-09 22:40:00',
               '2019-07-09 22:50:00', '2019-07-09 23:00:00',
               '2019-07-09 23:10:00', '2019-07-09 23:20:00',
               '2019-07-09 23:30:00', '2019-07-09 23:40:00',
               '2019-07-09 23:50:00', '2019-07-10 00:00:00'],
              dtype='datetime64[ns]', length=145, freq='10T')

In [222]:
pd.date_range(start= '20190709',periods = 10, freq = 'min')

DatetimeIndex(['2019-07-09 00:00:00', '2019-07-09 00:01:00',
               '2019-07-09 00:02:00', '2019-07-09 00:03:00',
               '2019-07-09 00:04:00', '2019-07-09 00:05:00',
               '2019-07-09 00:06:00', '2019-07-09 00:07:00',
               '2019-07-09 00:08:00', '2019-07-09 00:09:00'],
              dtype='datetime64[ns]', freq='T')

In [223]:
pd.date_range(start= '20190709',periods = 10, freq = '10s')

DatetimeIndex(['2019-07-09 00:00:00', '2019-07-09 00:00:10',
               '2019-07-09 00:00:20', '2019-07-09 00:00:30',
               '2019-07-09 00:00:40', '2019-07-09 00:00:50',
               '2019-07-09 00:01:00', '2019-07-09 00:01:10',
               '2019-07-09 00:01:20', '2019-07-09 00:01:30'],
              dtype='datetime64[ns]', freq='10S')

In [224]:
pd.date_range(start= '20190709',periods = 10, freq = 'm')

DatetimeIndex(['2019-07-31', '2019-08-31', '2019-09-30', '2019-10-31',
               '2019-11-30', '2019-12-31', '2020-01-31', '2020-02-29',
               '2020-03-31', '2020-04-30'],
              dtype='datetime64[ns]', freq='M')

# 表合并

In [232]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[2,3,4,5,6],
    'key':list('abcde')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      2   a
1      3   b
2      4   c
3      5   d
4      6   e

In [233]:
'''
   merge
'''
pd.merge(df01,df02,on = 'key')

   data1 key  data2
0      1   a      2
1      2   b      3
2      3   c      4
3      4   d      5
4      5   e      6

In [234]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[2,3,4,5,6],
    'key':list('abcfg')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      2   a
1      3   b
2      4   c
3      5   f
4      6   g

In [236]:
pd.merge(df01,df02,on = 'key',how = 'inner')  #inner交叉连接

   data1 key  data2
0      1   a      2
1      2   b      3
2      3   c      4

In [237]:
pd.merge(df01,df02,on = 'key',how = 'left')  #left左表连接

   data1 key  data2
0      1   a    2.0
1      2   b    3.0
2      3   c    4.0
3      4   d    NaN
4      5   e    NaN

In [238]:
pd.merge(df01,df02,on = 'key',how = 'right')   #right右表连接

   data1 key  data2
0    1.0   a      2
1    2.0   b      3
2    3.0   c      4
3    NaN   f      5
4    NaN   g      6

In [239]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key1':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[2,3,4,5,6],
    'key2':list('abcfg')
})
print(df01)
print(df02)

   data1 key1
0      1    a
1      2    b
2      3    c
3      4    d
4      5    e
   data2 key2
0      2    a
1      3    b
2      4    c
3      5    f
4      6    g

In [241]:
pd.merge(df01,df02,left_on = 'key1',right_on = 'key2',how = 'inner')

   data1 key1  data2 key2
0      1    a      2    a
1      2    b      3    b
2      3    c      4    c

In [242]:
pd.merge(df01,df02,left_on = 'key1',right_on = 'key2',how = 'left')

   data1 key1  data2 key2
0      1    a    2.0    a
1      2    b    3.0    b
2      3    c    4.0    c
3      4    d    NaN  NaN
4      5    e    NaN  NaN

In [246]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'key':list('abcde')
})
df02 = pd.DataFrame({
    'data2':[2,3,4,5,6],
    'key':list('abcfg')
})
print(df01)
print(df02)

   data1 key
0      1   a
1      2   b
2      3   c
3      4   d
4      5   e
   data2 key
0      2   a
1      3   b
2      4   c
3      5   f
4      6   g

In [247]:
pd.concat([df01,df02],join = 'inner')

  key
0   a
1   b
2   c
3   d
4   e
0   a
1   b
2   c
3   f
4   g

In [248]:
pd.concat([df01,df02],join = 'outer')  #纵向合并

/Users/qinxin/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  """Entry point for launching an IPython kernel.

   data1  data2 key
0    1.0    NaN   a
1    2.0    NaN   b
2    3.0    NaN   c
3    4.0    NaN   d
4    5.0    NaN   e
0    NaN    2.0   a
1    NaN    3.0   b
2    NaN    4.0   c
3    NaN    5.0   f
4    NaN    6.0   g

In [249]:
pd.concat([df01,df02],axis = 1,join = 'outer') #行索引合并，横向合并

   data1 key  data2 key
0      1   a      2   a
1      2   b      3   b
2      3   c      4   c
3      4   d      5   f
4      5   e      6   g

# 分组

In [267]:
df01 = pd.DataFrame({
    'data1':[1,2,3,4,5],
    'data2':[10,20,30,40,50],
    'key':list('aabba'),
    'sex':list('wmmww')
})
df01

   data1  data2 key sex
0      1     10   a   w
1      2     20   a   m
2      3     30   b   m
3      4     40   b   w
4      5     50   a   w

In [268]:
for i in df01.groupby('key'):
    print(i)

('a',    data1  data2 key sex
0      1     10   a   w
1      2     20   a   m
4      5     50   a   w)
('b',    data1  data2 key sex
2      3     30   b   m
3      4     40   b   w)

In [269]:
for i in df01.groupby('key'):
    print(i[1])

   data1  data2 key sex
0      1     10   a   w
1      2     20   a   m
4      5     50   a   w
   data1  data2 key sex
2      3     30   b   m
3      4     40   b   w

In [270]:
df01.groupby('key').mean()

        data1      data2
key
a    2.666667  26.666667
b    3.500000  35.000000

In [271]:
df01.groupby('key')['data1'].mean()

key
a    2.666667
b    3.500000
Name: data1, dtype: float64

In [272]:
df01.groupby('key')['data1'].max()

key
a    5
b    4
Name: data1, dtype: int64

In [275]:
df01.groupby(['key','sex'])['data1'].max()

key  sex
a    m      2
     w      5
b    m      3
     w      4
Name: data1, dtype: int64

In [277]:
'''
   apply  自定义的聚合函数,需要在括号中加一个类似的高阶函数lambda
'''
df01.groupby(['key','sex'])['data1'].apply(lambda x:x+10)

0    11
1    12
2    13
3    14
4    15
Name: data1, dtype: int64

In [279]:
df01.groupby(['key','sex'])['data1'].apply(lambda x:x.max())

key  sex
a    m      2
     w      5
b    m      3
     w      4
Name: data1, dtype: int64

In [280]:
df01.groupby(['sex'])['data1'].apply(lambda x:x+10)

0    11
1    12
2    13
3    14
4    15
Name: data1, dtype: int64

In [293]:
df01 = pd.DataFrame(np.random.randint(1,9,(4,4)),index = list('ABCD'),columns = list('abcd'))
df01

   a  b  c  d
A  3  7  3  3
B  4  7  2  5
C  4  5  5  5
D  5  1  6  5

In [294]:
df01.apply(lambda x:x+10)

    a   b   c   d
A  13  17  13  13
B  14  17  12  15
C  14  15  15  15
D  15  11  16  15

In [295]:
def f1(x):
    return x*10

df01.apply(f1)

    a   b   c   d
A  30  70  30  30
B  40  70  20  50
C  40  50  50  50
D  50  10  60  50

In [296]:
df01

   a  b  c  d
A  3  7  3  3
B  4  7  2  5
C  4  5  5  5
D  5  1  6  5

In [300]:
def f2(x):
    if x['a'] == 3:
        x['a'] = 200
        return x

df01.apply(f2,axis =1)
df01

     a  b  c  d
A  200  7  3  3
B    4  7  2  5
C    4  5  5  5
D    5  1  6  5